Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །ཡང་དེའི་ཚེ་གངས་ཀྱི་རི་དང་ཉེ་བ་ན་གནས་པ་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བ་བདུད་སྡིག་ཅན་གྱིས་བཏང་ནས།
en: At that time, the sage Jyotīrasa, who lived next to the Himalayas, spurred on by Māra, arrived in the vicinity of the gates of the great city of Rājagṛha, along with his retinue of five hundred.

source: དེ་གཡོག་ལྔ་བརྒྱ་དང་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྒོའི་དྲུང་ན་སྡོད་པས་བཅོམ་ལྡན་འདས་དྲང་སྲོང་གི་གཟུགས་དང་། རྟགས་དང་། ཁ་དོག་དང་། དབྱིབས་དང་། སྤྱོད་ལམ་དང་། བཀོད་པ་དེ་ལྟ་བུས་ལམ་ནས་གཤེགས་ཤིང་ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་མཆོད་པ་བྱེད་པར་བརྩོན་པར་མཐོང་སྟེ། མཐོང་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་སོ།
en: When he saw the Blessed One proceeding down the road in the form, features, color, shape, deportment, and style of a sage, and the many billions of gods diligently venerating him, he had the following thought:

source: །བདེན་པར་འདི་ནི་དྲང་སྲོང་ཆེན་པོ་མཐུ་ཆེ་ཞིང་མཆོད་པར་འོས་པ་སྟེ།
en: “Truly, this man is a great sage with tremendous power.

source: ལྷ་དང་མིས་མཆོད་པར་སྣང་ངོ་།
en: He is worthy of veneration and both gods and humans are venerating him.

source: །འདིའི་ལུས་ཐམས་ཅད་ཀྱང་བསོད་ནམས་ཀྱིས་མཚན་གྱིས་བརྒྱན་ཏེ།
en: His entire body is ornamented with the marks of merit.

source: མཁས་ཤིང་སློབ་དཔོན་ཡིན་པར་ཤེས་སོ།
en: I can see that he is a learned preceptor

source: །བདག་ཅག་གཉིས་གང་རྒན། གང་མཁས་པ་དེ་ལ་ངས་ཇི་ལྟར་བརྟག་སྙམ་སྟེ།
en: I would like to check to see which of the two of us is elder and more learned.

source: དེ་ནས་ཡང་འདི་ལྟར་བདག་གིས་མདུན་བསུ་ལ། འདི་ལ་རིགས་དང་། རུས་དང་། གནས་དང་། བརྟུལ་ཞུགས་ཀུན་དྲིའོ་སྙམ་དུ་སེམས་སོ།
en: So, I will go before him and inquire about his caste, family lineage, dwelling place, and ascetic discipline.”

source: །དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས་བདག་གི་འཁོར་ལ་བལྟས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the sage Jyotīrasa gazed upon his retinue and announced:

source: །ཐོས་ལྡན་ཡིད་འཐད་བརྟུལ་ཞུགས་ཆེ་འཛིན་མཆོད་པའི་རིགས་པར་སྣང་།
en: “There is one who is educated, honest, disciplined, venerable, and worthy of veneration.

source: །ཡེ་ཤེས་ཆོས་དོན་ལྡན་ཞིང་ཐུབ་མཆོག་བཟོད་འདི་ལམ་རབ་མཁྱེན།
en: He possesses wisdom and the meaningful Dharma—this supreme sage fully knows the path of acceptance.

source: །ཁྱེད་ཅག་ཐམས་ཅད་འདི་ལ་གུས་པར་མཆོད་ཆེན་ཡང་དག་སྦྱོར།
en: You all should join him, offering him respectful veneration,

source: །ཡོན་ཏན་ལྡན་པ་འདི་ལས་འཁོར་མཐར་འགྲོ་བའི་ལེགས་བཤད་མཉན།
en: And listen to the man of such qualities delivering his well-spoken doctrine that ends saṃsāra.”

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་མཁན་པོ་དེ་བཞིན་དུ་བགྱིའོ། །ཞེས་སྨྲས་སོ།
en: All the young brahmins in his retinue pledged with one voice that they would do as their preceptor had instructed.

source: །དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་གཡོག་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: The sage Jyotīrasa and his retinue then went to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་འདུག་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཁྱེད་སུ་ཞིག །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Standing before the Blessed One, they joined their palms and asked, “Who are you?”

source: ང་ནི་བྲམ་ཟེའོ། །གསོལ་པ།
en: The Blessed One answered, “I am a brahmin.”

source: ཁྱོད་ཀྱི་གདུང་རུས་ཅི། བཀའ་སྩལ་པ།
en: “What is your family lineage?”

source: ངའི་རུས་ནི་གཽ་ཏ་མའོ། །གསོལ་པ།
en: “I am of the Gautama family lineage.”

source: ཁྱོད་ཀྱི་བརྟུལ་ཞུགས་ཅི། བཀའ་སྩལ་པ།
en: “What is your ascetic discipline?”

source: ངའི་བརྟུལ་ཞུགས་ནི་རྣམ་པར་ཐར་པ་གསུམ་མོ། །གསོལ་པ།
en: “My ascetic discipline is the threefold liberation.”

source: ཁྱོད་ཀྱི་སྤྱོད་པ་ཅི། བཀའ་སྩལ་པ།
en: “What is your practice?”

source: ང་ནི་ཡང་དག་པའི་མཐའི་དེ་བཞིན་ཉིད་ལ་སྤྱོད་དོ། །གསོལ་པ།
en: “I practice suchness, the ultimate reality.”

source: ཁྱོད་རབ་ཏུ་བྱུང་ནས་ཇི་སྲིད་ལོན། བཀའ་སྩལ་པ།
en: “How long has it been since you went forth?”

source: མ་རིག་པ་བྱུང་ནས་ཇི་སྲིད་ལོན་པ་ང་རབ་ཏུ་བྱུང་ནས་ཀྱང་དེ་སྲིད་ལོན་ནོ།
en: “I have gone forth since ignorance arose.”

source: །གསོལ་པ། དྲང་སྲོང་ཆེན་པོ་སྐར་མ་བཤད་པ་ལུང་བསྟན་པའི་རིག་པ་གསུང་ངམ།
en: “Great Sage, can you explain the Vedic teachings of astrology?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྒྲོ་བཏགས་པ་མེད་པར་མཉམ་པ་ཉིད་དུའོ།
en: The Blessed One responded, “When one is free from superimposition, everything is the same.

source: །འདི་ནི་འཇིག་རྟེན་གྱི་ཤེས་པ་སྟེ། དེ་ལ་སྙིང་པོ་ཅི་ཞིག་ཡོད།
en: So from that perspective, what is the point of worldly knowledge?”

source: དྲང་སྲོང་གིས་གསོལ་པ། མཁས་པ་རྣམས་དགའ་བར་བགྱིད་པའོ།
en: “It delights the learned,” replied the sage.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐར་མའི་གནས་གང་ཡིན།
en: “Where do the stars abide?” asked the Blessed One.

source: དྲང་སྲོང་གིས་གསོལ་པ། གང་ཟླ་བ་དང་ཉི་མ་ལ་བརྟེན་ཅིང་རྗེས་སུ་རྒྱུ་བའི་རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་བརྗོད་པ་འདི་དག་གོ།
en: The sage answered, “There are said to be the twenty-eight constellations that are supported by, and follow, the sun and the moon.

source: །དེ་ལ་མཛུབ་ནི་སོར་བརྒྱད་ཀྱི་ཚད་དེ།
en: In relation to the measurement by fingers, there are thirty-eight.

source: མཛུབ་དེའི་ཚད་ཀྱིས་ལུས་ལ་སྲིད་དུ་མཛུབ་བཅུ་གཉིས་མཆིས་པར་རིག་པར་བགྱིའོ།
en: Using this measurement by fingers, there are twelve fingers lengthwise within the body where the stars abide.

source: །ཀླད་པའི་སྤྱི་བོ་ལ་མཛུབ་གང་དང་། རྐང་པའི་མཐིལ་ལ་མཛུབ་གང་སྟེ། མཛུབ་བཅུ་བཞི་ནི་སྐར་མ་རྣམས་ཀྱི་གནས་སོ།
en: With one measure of a finger at the brain in the head and one measure of a finger at the soles of the feet, there are a total of fourteen such fingers within the body.

source: །གང་དེ་དག་ན་གདའ་བ་ནི་རྣམ་པ་གཞན་དུ་མི་འགྱུར་ཏེ།
en: What exists at those locations does not change into anything else.

source: སྐར་མ་གང་དང་གང་ལ་བཙས་པ་དེ་དང་དེ་དག་ན་གདའོ།
en: Thus, the way one is follows the star under which one is born.

source: །ཡང་གང་ཞེ་ན།
en: What else is there? Let me explain.

source: དེ་བཤད་པར་བགྱི་ཡིས་ཐུབ་པ་ཆེན་པོ་གསོན་ཅིག །སྨིན་དྲུག་ལ་ནི་སུ་བཙས་པ།
en: Please listen, Great Sage! “Those who have a mole on the right side of their face

source: །དེ་ཡི་གདོང་གི་སོར་བཞི་ན། །གཡས་ཕྱོགས་ན་ནི་སྨེ་བ་མཆིས།
en: At the location of four fingers,

source: །སྤུ་ཅན་གནག་ལ་མདོག་ཀྱང་དམར།
en: A black beard, and ruddy hue Are born under the constellation Kṛttikā.

source: །ལོངས་སྤྱོད་བདོག་ཅིང་གྲགས་དང་ལྡན།
en: “They will have wealth and fame,

source: །མཁས་ཤིང་རབ་ཏུ་དཔལ་འབར་ཏེ། །སྨིན་དྲུག་ལ་ནི་སྐྱེས་པ་ཡི།
en: They will be learned, and their glory will spread.

source: །མཚན་མ་ཉིད་ནི་དེ་ལགས་སོ།
en: These are the signs of those Who are born under Kṛttikā. “Those who have a mole

source: །གང་ཞིག་ལ་ནི་སོར་བཞི་ན། །སྨེ་བ་འདི་ཉིད་གདའ་བ་དེ།
en: At the location of four fingers

source: །སྣར་མ་ལ་ནི་སྐྱེས་པ་སྟེ།
en: Are born under the constellation Rohiṇī.

source: །ཤེས་ཤིང་རྟག་ཏུ་ཆོས་ལ་དགའ།
en: They will be knowledgeable and constantly delight in the Dharma.

source: །མཁས་ལ་ལོངས་སྤྱོད་ཕུན་སུམ་ཚོགས།
en: “Learned and with abundant wealth,

source: །རྣམ་པ་ཀུན་ཏུ་མཛེས་དང་ལྡན།
en: Beautiful in all respects,

source: །དཔའ་ཞིང་རྒྱལ་བ་ཕུན་སུམ་ཚོགས། །དགྲ་རྣམས་རྟག་པར་རབ་ཏུ་འཇོམས།
en: Heroic and always victorious, They will defeat all their enemies. “Whoever has a mark resembling fire

source: །མགུལ་པ་ཡི་ནི་མཛུབ་ཕྱེད་ན། །གང་ལ་ཚིག་པ་འདྲ་གདའ་བ།
en: At the location half a finger from the neck

source: །དེ་ནི་མགོ་ལ་སྐྱེས་པ་སྟེ།
en: Is born under the constellation Mṛgaśirā

source: །དཔའ་ཞིང་ལོངས་སྤྱོད་ལྡན་པའོ།
en: And will be heroic and wealthy.

source: །མཛུབ་ཀྱི་ཕྱེད་པོ་གཉིས་པ་ལ།
en: “Whoever has a mole on the left side,

source: །གཡོན་ན་སྨེ་བ་གང་མཆིས་པ།
en: At the location of half a finger,

source: །ལག་ལ་སྐྱེས་པ་ཁྲོ་བ་སྟེ།
en: Is born under the constellation Ārdrā

source: །དེ་ནི་བླུན་ཞིང་ལོངས་སྤྱོད་བདོག །མཆན་ཁུང་གཡོན་ན་སྨེ་ནག་མཆིས།
en: And will be angry and foolish, but wealthy. “Those who have moles in the left armpit

source: །ནབ་སོ་ལ་ནི་སྐྱེས་པ་སྟེ།
en: Are born under the constellation Punarvasū.

source: །ནོར་དང་འབྲུ་རྣམས་འབྱོར་པར་འགྱུར།
en: They will have wealth and be rich in grain,

source: །དེ་ནི་ཤེས་པའི་རྒྱ་ཡང་ཆུང་།
en: Yet their mental resources will be limited.

source: །ཇི་ལྟར་ཁྱོད་ནི་རྒྱལ་ལ་སྐྱེས།
en: “Yet you, born under the constellation Puṣyā,

source: །མཚན་མཆོག་དག་ནི་རབ་ཏུ་གདའ།
en: Have the finest marks.

source: །ཕྱག་གི་མཐིལ་ན་འཁོར་ལོ་ནི།
en: On the palms of your hands there are wheels

source: །ཉི་མ་ལྟ་བུར་རབ་ཏུ་མཛེས།
en: That beautify you like the sun.

source: །དབུ་སྐྲ་དག་ནི་ཐམས་ཅད་ཀྱང་།
en: “All the hair on your head

source: །གྱེན་དུ་གཡས་འཁྱིལ་ལེགས་པར་མཆིས།
en: Twists upward to the right.

source: །སྐུ་ནི་ཆུ་ཞེང་གབ་པ་སྟེ།
en: Your body is of equal proportions.

source: །འདྲེན་པ་ཁྱེད་ཀྱིས་ཉོན་མོངས་ཐུལ།
en: You, O leader, have tamed your afflictions.

source: །ཚིག་འདྲ་གང་གི་སྙིང་ག་མཆིས།
en: “With a mark at the heart center resembling fire,

source: །སྐག་ལ་སྐྱེས་ཏེ་ཐབ་མོ་སྲེད།
en: Those born under the constellation Āśleṣā will crave violence.

source: །ཚུལ་ཁྲིམས་འཆལ་ཞིང་འགྲོགས་མི་བདེ།
en: Their discipline will be corrupt, and they will trouble their companions.

source: །དེ་ནི་གཡེམ་ལ་དགའ་བའོ།
en: They will delight in sexual misconduct. “Those who have a mole resembling a pea,

source: །འོག་གམ་བྲང་ངམ་རྒྱབ་ཅིག་ན། །གང་ལ་བྱི་སྲན་འདྲ་བ་གདའ།
en: Whether down low, on the front, or on the back,

source: །མཆུ་ལ་སྐྱེས་ཏེ་ནོར་དང་ལྡན།
en: Are born under the constellation Maghā.

source: །བཙུན་ཞིང་ཆོས་དང་ལྡན་པའི་མི།
en: They will be wealthy and disciplined religious people. “Those who have birthmarks

source: །ལྟེ་བ་གཡས་གཡོན་གཉིས་ཀ་ན། །གང་ལ་རྨ་འདྲ་གདའ་བ་ནི།
en: On both the left and right of the navel

source: །དེ་ནི་གྲེ་ལ་སྐྱེས་པ་སྟེ།
en: Are born under the constellation Pūrvaphalgunī

source: །སེར་སྣ་ཆེ་ཞིང་ཚེ་ཡང་ཐུང་།
en: And will be stingy and have a short life. “Those who have a mole

source: །ལྟེ་བ་མན་ཆད་སོར་བཞི་ན། །གང་ལ་སྨེ་བ་རབ་གདའ་བ།
en: Four fingers below the navel

source: །སྤོ་ལ་དེ་སྐྱེས་ལོངས་སྤྱོད་ཅན།
en: Are born under the constellation Uttaraphalgunī.

source: །ཁྲིམས་ལྡན་ཤི་འཕོས་མཐོ་རིས་མཆི།
en: Wealthy and disciplined, upon death they will go to the higher realms. “Those born under the constellation Hastā

source: །མེ་བཞི་ལ་ནི་སྐྱེས་པ་དག །སྨེ་བ་དམར་པོ་ཆུ་སོར་གདའ།
en: Will have a red mole on the buttocks.

source: །རྐུ་ཞིང་གཡོ་ཅན་སྒྱུ་མ་སྟེ།
en: They will thieve, deceive, and defraud.

source: །བསོད་ནམས་ཆུང་ཞིང་ཤེས་པ་ཞན།
en: Their merit is trifling and their intelligence meager.

source: །གང་གི་མཚན་ལ་སྨེ་བ་ནི།
en: “Those who have a mole on their penis

source: །གདའ་བར་གྱུར་པ་ངེས་པར་ཡང་།
en: Are definitely

source: །ནག་པ་ལ་ནི་སྐྱེས་པ་སྟེ།
en: Born under the constellation Citrā.

source: །འདོད་ཆགས་གླུ་གར་རྟག་ཏུ་དགའ།
en: Their preference will be for song and dance. “Those who have a yellow mole,

source: །མཚན་གྱི་འོག་གམ་སྟེང་ན་ནི། །སྨེ་བ་སེར་པོ་རབ་ཏུ་གདའ།
en: Either above or below the penis,

source: །ས་རི་ལ་ནི་དེ་སྐྱེས་ཏེ།
en: Are born under the constellation Svāti.

source: །མི་མཁས་བརྐམ་ཞིང་མང་པོ་སྡང་།
en: They are not learned, but desirous and often angry.

source: །བརླ་གཉིས་ཀྱི་ནི་མཛུབ་གང་ན།
en: “Those who, at one finger of both thighs,

source: །སྨེ་བ་དམར་པོ་དེ་བཞིན་ཏེ།
en: Have a red mole Are perfect lords born under the constellation Viśākhā

source: །ས་ག་ལ་སྟེ་ཤོར་བ་མཆོག །སྐྱེས་པ་བུད་མེད་རྣམས་ཀྱིས་བསྐོར།
en: And will be attended by men and women,

source: །མཁས་ཤིང་དཔའ་ལ་དགྲ་ཡང་ཐུལ།
en: “Learned and brave, defeating their enemies,

source: །རྟག་ཏུ་བདེ་ལ་གནས་པ་སྟེ།
en: Always enjoying a pleasant life,

source: །ངོ་ཚ་ཤེས་ཤིང་བརྟན་དང་ལྡན།
en: Modest, intelligent, and reliable.

source: །ཤི་འཕོས་ནས་ནི་མཐོ་རིས་སྐྱེ།
en: Having died, they will be reborn in the higher realms. “Those who have a mole like a pea

source: །བརླ་གཉིས་ཀྱི་ནི་མཛུབ་དོ་ན། །གང་ལ་བྱི་སྲན་འདྲ་བ་གདའ།
en: At one finger of both thighs

source: །ལྷ་མཚམས་ལ་སྟེ་ཚུལ་ཁྲིམས་ཅན།
en: Practice discipline and are born under the constellation of Anurādhā.

source: །ཆོས་དང་ལོངས་སྤྱོད་ལྡན་པའོ།
en: They have both Dharma and enjoyments.

source: །གང་གི་བརླ་འོག་གཉིས་ན་ནི།
en: “Those who have a mole underneath their thighs

source: །སྨེ་བ་གདའ་བ་སྣྲོན་ལ་སྐྱེས།
en: Are born under the constellation Jyeṣṭhā.

source: །མི་སྡུག་ཚེ་ཐུང་ཚུལ་ཁྲིམས་འཆལ།
en: They are ugly, short-lived, and corrupt in discipline

source: །དབུལ་ཞིང་སྙིང་རྗེ་མ་མཆིས་སོ།
en: They are neither ethical nor compassionate.

source: །པུས་མོ་གཉིས་ཀའི་གོང་ན་ནི།
en: “Those who have, on both knees,

source: །གང་ལ་རྨ་ཆུང་གདའ་བ་དེ།
en: Small birthmarks

source: །སྣྲུབས་ལ་སྐྱེས་ཏེ་དབང་ཐང་ཅན།
en: Are charismatic people born under the constellation Mūlā.

source: །མྱུར་དུ་བདག་ཁྱིམ་ཞིག་པར་བགྱིད།
en: They will swiftly destroy their own homes.

source: །ཆུ་སྟོད་ལ་ནི་སྐྱེས་པ་དག །སྨེ་བ་པུས་མོའི་ལྷ་ང་ན།
en: “Those born under the constellation Pūrvāṣāḍhā Have moles on their kneecaps.

source: །སྦྱིན་པ་བགྱིད་ཅིང་ཆོས་ལམ་འཚལ།
en: They practice charity and desire the Dharma path.

source: །ཤི་འཕོས་ནས་ནི་མཐོ་རིས་མཆི།
en: At death, they go to the higher realms.

source: །ཆུ་སྨད་ལ་ནི་སུ་སྐྱེས་པ།
en: “Those born under the constellation Uttarāṣāḍhā

source: །གྲུ་དོ་ལ་ནི་སྨེ་བ་མཆིས།
en: Have moles on their elbows.

source: །དེ་ལྟར་གདའ་བ་ཤེས་དང་ལྡན།
en: In that regard, they are intelligent,

source: །ལོངས་སྤྱོད་ལྡན་ཞིང་སེམས་ཅན་བྱམས།
en: Wealthy, and loving toward others.

source: །སྨེ་བ་གཉིས་པོ་གདའ་བ་ནི།
en: “They who have moles on both elbows Are born under the constellation Śravaṇā.

source: །གྲོ་བཞིན་ལ་སྟེ་ལོངས་སྤྱོད་རྟག །དེ་བཞིན་ནད་མེད་སེམས་ཅན་བྱམས།
en: They are always wealthy, healthy, and loving toward others.

source: །སྨེ་བ་ནག་པོ་རྗེ་ངར་ལ།
en: “Those who have black moles on their calves

source: །གདའ་བ་མོན་གྲུ་སྐྱེས་པ་སྟེ།
en: Are born under the constellation Dhaniṣṭhā.

source: །དེ་ནི་ཁྲོ་ཞིང་འདོད་ཆགས་ཆུང་།
en: They will have little anger or desire.

source: །ལོངས་སྤྱོད་མ་མཆིས་ཤེས་རབ་ལྡན། །རྗེ་ངར་ལ་ནི་མཛུབ་དོ་ན།
en: They will have no wealth, but they will be wise.

source: །སྨེ་བ་ནག་པོ་རབ་ཏུ་གདའ།
en: “Those who have black moles At the finger measure on their calves

source: །མོན་གྲེ་ལ་སྐྱེས་བླུན་པོ་སྟེ།
en: Are born under the constellation Śatabhiṣā.

source: །དེ་ནི་ཆུ་ཡིས་འཆི་བར་འགྱུར།
en: They are foolish and will end up drowning.

source: །རྗེ་ངར་འོག་གི་མཛུབ་གང་ན།
en: “Those who have something like a scar at the finger below their calves

source: །རྨ་འདྲ་མཆིས་པ་ཁྲུམས་སྟོད་ལ།
en: Are born under the constellation Pūrvabhadrapadā.

source: །བླུན་ཞིང་གཞན་ལ་གནོད་པ་བགྱིད།
en: They are foolish and prone to injure others,

source: །དེ་ནི་དབུལ་ཞིང་རྐུན་པོ་བགྱིད།
en: Are destitute, and often steal.

source: །གང་ལ་སྨེ་བ་མཛུབ་གང་ན།
en: “Those who have moles throughout their finger measures

source: །ཁྲུམས་སྨད་ལ་ནི་སྐྱེས་པ་སྟེ།
en: Are born under the constellation Uttarabhadrapadā. They are generous, disciplined, mindful,

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་དྲན་པ་དང་། །ཤེས་རབ་འཇིགས་མེད་སྙིང་རྗེར་ལྡན།
en: Knowledgeable, fearless, and compassionate. “Those who have tiny moles

source: །གང་གི་རྐང་པ་གཉི་ག་ལ། །སྨེ་བ་ཕྲ་མོ་གདའ་བ་ནི།
en: On both their legs

source: །ནམ་གྲུ་སྐྱེས་པ་མ་རབས་ཏེ།
en: Are born under the constellation Revatī.

source: །འདྲེག་མཁན་དུ་ཡང་འགྱུར་བ་ལགས།
en: They are ill-mannered and become barbers.

source: །གང་གི་མཐེ་བོའི་ཕྲག་ན་ཡང་།
en: “Those who have black moles

source: །སྨེ་བ་སྔོན་པོ་གདའ་བ་ནི།
en: On their thumb joints

source: །རྟག་ཏུ་སྟོབས་ལྡན་ནད་མ་མཆིས།
en: Are always vital and healthy

source: །ཐ་སྐར་ལ་ནི་དེ་སྐྱེས་སོ།
en: And born under the constellation Aśvinī.

source: །རྐང་མཐིལ་སྨེ་བ་མཆིས་པ་ནི།
en: “Those who have moles on the soles of their feet Are born under the constellation Bharaṇī.

source: །བྲ་ཉེ་ལ་སྟེ་སྙིང་བརྩེ་མེད། །གསོད་པའི་གཤེད་མའི་ངང་ཚུལ་ཅན།
en: They are loveless and have the character of killers and executioners.

source: །ཤི་འཕོས་ནས་ནི་དམྱལ་བར་མཆི།
en: When they die, they go to the hell realms.

source: །གང་གིས་སྤྱོད་པ་འཚལ་བ་ཡི།
en: “Those who undertake particular types of conduct

source: །སྐར་མའི་གནས་ནི་འདི་དག་ལགས།
en: Bear these astrological signs.

source: །འཇིག་རྟེན་ན་ནི་རྣམ་ཤེས་འདིས།
en: It is consciousness that leads beings

source: །སེམས་ཅན་རྣམས་ནི་ཕ་རོལ་འདྲེན།
en: Around the universe.”

source: ཀུན་ཏུ་རྟོག་པའི་སྤྱོད་ཡུལ་ཅན།
en: “Childish beings whose experience is conceptual

source: །བྱིས་པ་གང་ལ་ཆགས་འདུག་པ།
en: Can be attached to anything.

source: །དེ་ནི་བྱིས་པ་རྨོངས་པ་སྟེ།
en: They are deluded and spiritually immature.

source: །སེམས་ལ་གནས་ཤིང་རིམས་ནད་བཅས།
en: They live in their heads and catch infectious diseases.

source: །ཁྱི་དང་སྦྲུལ་དང་རུ་སྦལ་དང་། །སྲོག་ཆགས་གཞན་ཡང་རྣམ་མང་པོ།
en: “Dogs, snakes, turtles, And various other kinds of animals,

source: །སྐར་མ་རྒྱལ་ལ་གང་སྐྱེས་པ།
en: And anyone born under the constellation Puṣyā,

source: །དེ་དག་བདེ་ལ་སྟེན་མ་ཡིན།
en: Do not experience well being.

source: །ཇི་ལྟར་བསམ་གཏན་རྫུ་འཕྲུལ་དང་། །ཐར་པ་ཁྱོད་ཀྱིས་རྙེད་པ་བཞིན།
en: “Just as you have acquired Absorption, magical powers, and freedom,

source: །ང་ཡང་ཐམས་ཅད་གཟིགས་པ་ན།
en: I myself am all-seeing,

source: །ཅི་ཕྱིར་ང་ལ་ཁྱོད་མི་འདྲི།
en: So why don’t you ask me your questions?”

source: །དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས་བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གིས་གཏོར་ནས་ཡིད་རབ་ཏུ་དགའ་སྟེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The sage Jyotīrasa showered the Blessed One with flowers and was deeply pleased. He then inquired:

source: །དྲང་སྲོང་མི་ཡི་གཟུགས་སུ་ནི།
en: “O sage in human form

source: །མཚན་མཆོག་རྣམས་ཀྱང་ཤིན་ཏུ་གདའ།
en: Who is replete with the finest marks,

source: །ཁྱོད་ཀྱི་གདུང་རུས་མ་འཚལ་ན།
en: Given that I do not know your ancestry,

source: །ལྷ་འམ་འོན་ཏེ་ཁྱོད་མི་ལགས།
en: I would like to know if you are a god or a man.

source: །གསུང་དང་དབྱངས་དག་འབྱིན་པ་ནི།
en: “When your speech and voice are heard,

source: །ཚངས་པ་ཆེན་པོ་བཞིན་དུ་གདའ།
en: They are like those of Mahābrahmā.

source: །སྤྱོད་པའི་གནས་དང་ཚུལ་གྱིས་ནི།
en: The actions you take and the manner in which you behave

source: །སྔོན་གྱི་དྲང་སྲོང་རྣམས་དང་འདྲ།
en: Resemble the sages of yore.

source: །ཐུབ་པ་ཅི་འདྲ་ཕུན་སུམ་ཚོགས།
en: “Sage, how are you so excellent,

source: །འདི་སྔོན་མ་མཐོང་མ་ཐོས་ན།
en: Such that I’ve never seen or heard of anyone like you before?

source: །ཁྱོད་ཀྱི་སྟོན་གང་དེ་ཅི་སྨྲ།
en: Please tell me who your teacher was,

source: །ཁྱོད་ཀྱི་གདུང་རུས་ཅི་ལགས་གསུངས།
en: And what your ancestry is!”

source: །ཕ་རོལ་ཚུ་རོལ་མི་ཤེས་ཤིང་།
en: “I am not concerned with high or low.

source: །མཚན་མ་ལ་ནི་གང་གནས་པ།
en: Whoever is stuck with such designations

source: །དེ་དག་སྡུག་བསྔལ་ཀུན་གྱིས་བཅིངས།
en: Binds themselves to all manner of suffering—

source: །དེ་ནི་ཐར་པའི་སྣོད་མ་ཡིན།
en: They are not fitting vessels for freedom.

source: །ཕ་རོལ་ཕྱིན་དྲུག་ང་ཡི་རུས།
en: “My lineage is the six perfections.

source: །བྲམ་ཟེ་མངོན་ཤེས་དྲུག་དང་ལྡན།
en: With them I destroy brahmins with the six superknowledges,

source: །ཡང་དག་དགའ་བྱ་དྲུག་སྨྲ་ཞིང་།
en: Those who preach the six sources of joy,

source: །དབང་པོ་དྲུག་ནི་རྣམ་པར་བཤིག །ཆོས་གསུམ་རྟོགས་པའི་ཤེས་དང་ལྡན།
en: And the six faculties. “I have the knowledge that understands the three phenomena.

source: །ང་ཡི་སྤྱོད་པ་རྣམ་ཐར་གསུམ། །བྱང་ཆུབ་སེམས་ནི་ནམ་སྐྱེས་པ།
en: My conduct is the threefold liberation.

source: །དེ་ཚེ་ང་ནི་རབ་ཏུ་བྱུང་།
en: I went forth at the moment That I developed the mind of awakening.

source: །མཚན་མ་རྣམས་ནི་ངས་མ་དམིགས།
en: “I do not focus on any signs—

source: །མཚན་མ་མེད་པ་རབ་ཏུ་བསྒོམས།
en: Indeed I cultivate signlessness. I am a perfect buddha,

source: །སེམས་ཅན་མེད་ཅིང་སྲོག་མེད་པ། །བདག་མེད་སྟོང་པར་མངོན་སངས་རྒྱས།
en: Teaching the absence of being, life principle, and self. “I have fully cultivated the emptiness

source: །ཚོར་བ་གསུམ་དང་འདུ་བྱེད་གསུམ། །སྟོང་པ་ཉིད་དུ་རྣམ་པར་བསྒོམས།
en: Of the three sensations and the three formations.

source: །ང་ནི་ཡེ་ཤེས་ཕ་རོལ་སོང་།
en: My wisdom has reached the far shore.

source: །ང་ཡི་ཚིགས་འདི་གསུངས་པ་མེད།
en: Nothing is communicated by my words.

source: །གང་དག་མཁའ་བཞིན་མ་ཆགས་པར།
en: “Anyone who is unattached like space

source: །བྱང་ཆུབ་ཕྱིར་ནི་སེམས་བསྐྱེད་པ།
en: And arouses the mind set upon awakening

source: །དེ་དག་བཟོད་སྟོབས་ཕུན་སུམ་ཚོགས།
en: Will achieve the perfect strength of patience,

source: །ཡེ་ཤེས་འདི་འདྲ་ཐོབ་པར་འགྱུར།
en: As well as wisdom. “Awakening is not difficult to find

source: །ཆོས་རྣམས་ལ་ནི་མི་འཇུག་ཅིང་།
en: For one who does not engage with phenomena,

source: །རྣམ་པར་སྨིན་པ་འདོད་མེད་ལ།
en: Has no desire for karmic ripening,

source: །དེ་བཞིན་ཉིད་ལས་འགལ་མི་བྱེད།
en: And does not contradict suchness.

source: །དེ་དག་བྱང་ཆུབ་རྙེད་མི་དཀའ།
en: “If one contemplates the ultimate reality

source: །ཆོས་རྣམས་ལ་ནི་མི་གནས་ཤིང་། །ཕ་རོལ་ཚུ་རོལ་མི་རྟེན་པར།
en: Without fixating on phenomena

source: །ཡང་དག་མཐར་ནི་འདིར་བསྒོམས་ན།
en: Or adhering to high or low,

source: །དེ་བཞིན་གཤེགས་པ་ཉིད་དུ་འགྱུར།
en: One will become a thus-gone one.

source: །མཚན་ཉིད་མེད་ཅིང་མཚན་མའང་མེད།
en: “There are no characteristics or marks.

source: །དམིགས་པ་དེ་ནི་རྣམ་པར་སྤངས།
en: If one abandons such reference points,

source: །ཆོས་རྣམས་ཀུན་དང་མ་འདྲེས་ན།
en: And does not get involved with any phenomenon,

source: །རང་གི་མཚན་ཉིད་འདིར་འོང་ལ།
en: “Give up specific characteristics!

source: །རང་གི་སེམས་ལ་ཐེ་ཚོམ་སྤོངས།
en: Abandon all doubt in your mind!

source: །ནམ་མཁའ་འདྲ་བར་ཤེས་ནས་སུ།
en: Expand your knowledge like space!

source: །ང་འདྲར་སངས་རྒྱས་ཁྱོད་འགྱུར་བྱོས།
en: You must become a buddha like me!”

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་དེ་དག་གསུངས་མ་ཐག་ཏུ་དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་གཡོག་དང་བཅས་པས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་གཟུགས་དང་། རྟགས་དང་། སྤྱོད་ལམ་དུ་ཞུགས་པར་མཐོང་ནས་སྔོན་གྱི་དགེ་བའི་རྩ་བ་རྣམས་མངོན་དུ་གྱུར་ཏོ།
en: Immediately after the Blessed Buddha had spoken these verses, the sage Jyotīrasa and his retinue saw the Blessed One transform into the form , features, and deportment of a buddha as their previously accumulated roots of virtue became activated.

source: །དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས་ཏིང་ངེ་འཛིན་གང་ཐོབ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་མཚན་གྱི་རྩེ་མོ་བཞིན་དུ་འདུག་ནས། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ལྟ་ཞིང་གཞན་ལ་རག་ལས་པ་མེད་དེ།
en: The sage Jyotīrasa then attained a state of absorption such that, sitting like the bodhisattva Peak of the Victory Banner, he was able to see into all states of absorption without depending on any other factors.

source: ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པར་འགྱུར་བ།
en: Through all these forms of absorption, his state became such that nobody could take it away from him.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རིན་པོ་ཆེ་ཏོག་ཅེས་བྱ་བ་ཐོབ་པོ།
en: He attained the bodhisattva absorption called Ratnaketu.

source: །དེ་ནས་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ནས་ལག་པ་གཉིས་ན་མེ་ཏོག་ཐོགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: The great sage, holding a flower in his folded hands, then praised the Blessed One with the following verses:

source: །ཡོན་ཏན་མཐའ་ཡས་འཇིག་རྟེན་མགོན་པོ་བདེན་པ་གསུང་བ་ལེགས་བཞུགས་པ།
en: “O protector of the world worthy of infinite praise! A confirmed speaker of truth!

source: །ཁྱེད་ཀྱི་ཡེ་ཤེས་སྤྱན་གྱི་འོད་ཟེར་གྱིས་ནི་འཇིག་རྟེན་ཀུན་སྣང་མཛད།
en: You have illuminated the entire world with the light from your eye of wisdom.

source: །རྟག་ཏུ་སེམས་ཅན་ཀུན་གྱི་སླད་དུ་དཔའ་བོ་བྱམས་པས་མངོན་འཕགས་པ།
en: For the benefit of beings, you always elevate your courage and loving kindness.

source: །སེམས་ཅན་སྙིང་པོ་ཆགས་པ་ཟད་པ་འདྲེན་པ་ཁྱོད་ལ་དེང་ཕྱག་འཚལ།
en: O best of beings, leader free from attachment, I prostrate to you today!

source: །གསེར་གྱི་ཁ་དོག་གསེར་དང་འདྲ་བའི་འོད་ཟེར་རྣམས་ཀྱིས་བསིལ་གྱུར་པའི།
en: “With your golden color and glow of golden light, your cooling qualities

source: །ཡོན་ཏན་དག་གིས་སེམས་ཅན་ཐམས་ཅད་བྱང་ཆུབ་རྒྱུར་འགྱུར་རབ་ཏུ་བསྐུལ།
en: Help inspire the causes that lead to the attainment of awakening in all beings.

source: །ཁྱོད་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་བསྐོར་ཉོན་མོངས་རི་རྣམས་བཅོམ་པར་གྱུར།
en: By turning the wheel of the Dharma, you split the mountain of the afflictions

source: །ཐ་མའི་སྤྱོད་པ་བྱང་ཆུབ་ཤེས་པའི་རྒྱུ་ནི་དེ་རིང་མཐར་ཕྱིན་ཏོ།
en: And perfect the supreme conduct and the causes of understanding awakening.

source: །སྨན་པ་ཆེན་པོ་སེམས་ཅན་སྙིང་པོ་མཚན་རྣམས་ཀྱིས་ནི་རབ་བརྒྱན་པ།
en: “O great physician, the best of beings adorned with auspicious marks,

source: །སེམས་ཅན་སྙིང་པོ་སངས་རྒྱས་འགྱུར་བ་འདྲེན་པ་དེ་རིང་བཤད་དུ་གསོལ།
en: Guide, please explain today how the essence of a being becomes buddha.
